### [Automation Tools for Excel Users](https://towardsdatascience.com/use-python-to-design-automation-tools-for-excel-users-e824b37c646d)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("data/store-item-train.csv")
df.head()

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [3]:
df.shape

(913000, 4)

In [6]:
print(f"{df.shape[0]:,} transactions in your raw data")

913,000 transactions in your raw data

In [7]:
df["date"]=pd.to_datetime(df["date"])
df.dtypes

date     datetime64[ns]
store             int64
item              int64
sales             int64
dtype: object

In [8]:
df["month"]=df.date.dt.month
df["year"]=df.date.dt.year
df.tail()

             date  store  item  sales  month  year
912995 2017-12-27     10    50     63     12  2017
912996 2017-12-28     10    50     59     12  2017
912997 2017-12-29     10    50     74     12  2017
912998 2017-12-30     10    50     62     12  2017
912999 2017-12-31     10    50     82     12  2017

In [13]:
df["month-year"]=df.month.astype(str).str.zfill(2) + "-" +\
df.year.astype(str).str.zfill(2)
df["month-year"].head()

0    01-2013
1    01-2013
2    01-2013
3    01-2013
4    01-2013
Name: month-year, dtype: object

In [14]:
df.head()

        date  store  item  sales  month  year month-year
0 2013-01-01      1     1     13      1  2013    01-2013
1 2013-01-02      1     1     11      1  2013    01-2013
2 2013-01-03      1     1     14      1  2013    01-2013
3 2013-01-04      1     1     13      1  2013    01-2013
4 2013-01-05      1     1     10      1  2013    01-2013

In [15]:
df.dtypes

date          datetime64[ns]
store                  int64
item                   int64
sales                  int64
month                  int64
year                   int64
month-year            object
dtype: object

In [16]:
df_store = pd.pivot_table(df, values='sales', index=['store', 'item'],
                    columns=['month-year'], aggfunc=np.sum).fillna(0)

In [17]:
df_store.head()

month-year  01-2013  01-2014  01-2015  01-2016  01-2017  02-2013  02-2014  \
store item
1     1         328      435      428      449      485      322      405
      2         911     1116     1114     1248     1202      873     1135
      3         547      654      719      795      788      597      674
      4         346      366      454      447      488      340      415
      5         276      330      367      413      407      276      314

month-year  02-2015  02-2016  02-2017  ...  11-2013  11-2014  11-2015  \
store item                             ...
1     1         399      450      487  ...      572      619      684
      2        1157     1270     1196  ...     1427     1595     1680
      3         670      791      777  ...      900     1020     1059
      4         407      491      464  ...      519      640      605
      5         335      417      432  ...      422      501      509

month-year  11-2016  11-2017  12-2013  12-2014  12-2015  12-2016  12-2017
store item
1     1         662      668      388      409      460      496      533
      2        1789     1962     1023     1211     1227     1338     1475
      3        1134     1156      657      729      750      831      873
      4         643      701      393      474      461      555      497
      5         559      575      356      343      380      440      436

[5 rows x 60 columns]